

function dif = integ(t, f)

    J_2 = 1082625.75e-9; %зональный гармонический коэффициент второй степени, характеризующий пол€рное сжатие «емли
    GM = 398600.4418e9; %геоцентрическа€ константа гравитационного пол€ «емли с учетом атмосферы
    a_e = 6378136; %больша€ полуось общеземного эллипсоида
   
    r = sqrt(f(1)^2 + f(2)^2 + f(3)^2);
    ff = [f(1)/r; f(2)/r; f(3)/r];
    
    GM0 = GM/(r^2);
    R = a_e/r;
    F = [f(4); f(5); f(6); -GM0*ff(1) - (3/2)*J_2*GM0*ff(1)*(R^2)*(1-5*(ff(3)^2)); -GM0*ff(2) - (3/2)*J_2*GM0*ff(2)*(R^2)*(1-5*(ff(3)^2)); -GM0*ff(3) - (3/2)*J_2*GM0*ff(3)*(R^2)*(3-5*(ff(3)^2))];
        dif = F;
end